In [1]:
import pandas as pd

In [2]:
df=pd.DataFrame({'Weight':[45,88,65,89,56],
                'Name':['Rahul','ARjun','Amit','Nancy','Radhika'],
                'Age':[12,45,23,43,28]})
df.index=['Row1','Row2','Row3','Row4','Row5']
df
df.loc['Row2','Name']

'ARjun'

In [3]:
df

      Weight     Name  Age
Row1      45    Rahul   12
Row2      88    ARjun   45
Row3      65     Amit   23
Row4      89    Nancy   43
Row5      56  Radhika   28

In [11]:
df=pd.DataFrame({'Weight':[45,88,65,89,56],
                'Name':['Rahul','ARjun','Amit','Nancy','Radhika'],
                'Age':[12,45,23,43,28]})
df.index=['Row1','Row2','Row3','Row4','Row5']
df
df.loc[:,['Name','Age']]

         Name  Age
Row1    Rahul   12
Row2    ARjun   45
Row3     Amit   23
Row4    Nancy   43
Row5  Radhika   28

In [12]:
df=pd.DataFrame({'Weight':[45,88,65,89,56],
                'Name':['Rahul','ARjun','Amit','Nancy','Radhika'],
                'Age':[12,45,23,43,28]})
df.index=['Row1','Row2','Row3','Row4','Row5']
df
df.loc[['Row1','Row2']]

      Weight   Name  Age
Row1      45  Rahul   12
Row2      88  ARjun   45

In [8]:
df=pd.DataFrame({'A':[45,88,65,None,56],
                'B':['Rahul','ARjun','Amit','Nancy',None],
                'C':[12,45,23,43,28],
                'D':[1,2,3,4,None]})
df.index=['Row1','Row2','Row3','Row4','Row5']
df
df.loc[:,['A','D']]

         A    D
Row1  45.0  1.0
Row2  88.0  2.0
Row3  65.0  3.0
Row4   NaN  4.0
Row5  56.0  NaN

In [9]:
df=pd.DataFrame({'A':[45,88,65,None,56],
                'B':['Rahul','ARjun','Amit','Nancy',None],
                'C':[12,45,23,43,28],
                'D':[1,2,3,4,None]})
df.index=['Row1','Row2','Row3','Row4','Row5']
df
df.loc[:,['A','B','C']]

         A      B   C
Row1  45.0  Rahul  12
Row2  88.0  ARjun  45
Row3  65.0   Amit  23
Row4   NaN  Nancy  43
Row5  56.0   None  28